kuilb/esp32_1602/src/services/web_setting.cpp
#include "./services/web_setting.h"

#include "./hardware/opt3001.h"
#include "./hardware/fuel_gauge.h"
#include "./services/auto_brightness.h"
#include "./services/config_manager.h"
#include "./hardware/buzzer.h"
#include "esp32-hal-cpu.h"

extern QWeatherAuthConfigManager qweatherAuthConfigManager;

WebServer settingServer(80);
volatile bool isConfigDone = false;
volatile bool isKeyDone = false;
volatile bool otaUploadSuccess = false;
static size_t otaExpectedSize = 0;      // 预期的OTA文件大小
static bool s_otaModuleInitialized = false;

static const char* _wifiStateToStr(WiFiConnectionState state) {
    switch (state) {
        case WIFI_IDLE: return "idle";
        case WIFI_CONNECTING: return "connecting";
        case WIFI_CONNECTED: return "connected";
        case WIFI_DISCONNECTED: return "disconnected";
        case WIFI_FAILED: return "failed";
        default: return "unknown";
    }
}

void webSettingHandleDeviceStatus() {
    String json = "{";
    json += "\"brightness\":" + String(brightness) + ",";
    json += "\"autoBrightness\":" + String(isAutoBrightnessActive() ? "true" : "false") + ",";
    json += "\"soundEffects\":" + String(buzzerIsUiSoundEnabled() ? "true" : "false");
    json += "}";
    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleCitySearchReady() {
    const bool ready = qweatherAuthConfigManager.checkApiConfigValid();
    String json = "{";
    json += "\"ready\":" + String(ready ? "true" : "false") + ",";
    json += "\"message\":\"" + String(ready ? "配置完整，可进行城市搜索" : "和风天气密钥未完整配置，无法搜索") + "\"";
    json += "}";
    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleDeviceBasicInfo() {
    const unsigned long uptimeMs = millis();
    const size_t freeHeap = ESP.getFreeHeap();
    const size_t totalHeap = ESP.getHeapSize();
    const size_t freePsram = ESP.getFreePsram();
    const size_t totalPsram = ESP.getPsramSize();

    String json = "{";
    json += "\"projectVersion\":\"" + String(PROJECT_VERSION) + "\",";
    json += "\"buildVersion\":\"" + String(BUILD_VERSION) + "\",";
    json += "\"buildTimestamp\":\"" + String(BUILD_TIMESTAMP) + "\",";
    json += "\"uptimeMs\":" + String(uptimeMs) + ",";
    json += "\"cpuFreqMHz\":" + String(getCpuFrequencyMhz()) + ",";
    json += "\"freeHeap\":" + String(freeHeap) + ",";
    json += "\"totalHeap\":" + String(totalHeap) + ",";
    json += "\"freePsram\":" + String(freePsram) + ",";
    json += "\"totalPsram\":" + String(totalPsram) + ",";
    json += "\"resetReason\":" + String((int)esp_reset_reason());
    json += "}";

    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleAlsRealtimeInfo() {
    const float lux = isOPT3001Connected ? readLux() : -1.0f;
    const float smoothedLux = getCurrentLux(true);

    String json = "{";
    json += "\"connected\":" + String(isOPT3001Connected ? "true" : "false") + ",";
    json += "\"lux\":" + String(lux, 2) + ",";
    json += "\"smoothedLux\":" + String(smoothedLux, 2);
    json += "}";

    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleFuelGaugeRealtimeInfo() {
    const uint16_t voltage = readVoltage();
    const int16_t current = readAverageCurrent();
    const uint8_t soc = readStateOfCharge();

    String json = "{";
    json += "\"connected\":" + String(isfuelICConnected ? "true" : "false") + ",";
    json += "\"voltageMv\":" + String(voltage) + ",";
    json += "\"currentMa\":" + String(current) + ",";
    json += "\"soc\":" + String(soc);
    json += "}";

    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleWifiInfo() {
    String json = "{";
    json += "\"state\":\"" + String(_wifiStateToStr(wifiConnectionState)) + "\",";
    json += "\"wlStatus\":" + String((int)WiFi.status()) + ",";
    json += "\"ssid\":\"" + WiFi.SSID() + "\",";
    json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
    json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
    json += "\"mac\":\"" + WiFi.macAddress() + "\"";
    json += "}";

    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleSetBrightness() {
    if (settingServer.method() != HTTP_POST) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"请使用 POST 方法\"}");
        return;
    }

    if (!settingServer.hasArg("value")) {
        settingServer.send(400, "application/json; charset=utf-8", "{\"error\":\"缺少 value 参数\"}");
        return;
    }

    int value = settingServer.arg("value").toInt();
    if (value < 0) value = 0;
    if (value > 255) value = 255;

    disableAutoBrightness();
    setLcdBrightness((uint8_t)value);
    ConfigManager::saveAutoBrightnessEnabled(false);

    String json = "{";
    json += "\"ok\":true,";
    json += "\"brightness\":" + String(brightness) + ",";
    json += "\"autoBrightness\":false";
    json += "}";
    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleToggleAutoBrightness() {
    if (settingServer.method() != HTTP_POST) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"请使用 POST 方法\"}");
        return;
    }

    const bool enabled = toggleAutoBrightness();
    ConfigManager::saveAutoBrightnessEnabled(enabled);

    String json = "{";
    json += "\"ok\":true,";
    json += "\"autoBrightness\":" + String(enabled ? "true" : "false") + ",";
    json += "\"brightness\":" + String(brightness);
    json += "}";
    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleToggleSoundEffects() {
    if (settingServer.method() != HTTP_POST) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"请使用 POST 方法\"}");
        return;
    }

    const bool enabled = !buzzerIsUiSoundEnabled();
    buzzerSetUiSoundEnabled(enabled);
    ConfigManager::saveSoundEffectsEnabled(enabled);
    if (enabled) {
        buzzerPlaySelectSound();
    }

    String json = "{";
    json += "\"ok\":true,";
    json += "\"soundEffects\":" + String(enabled ? "true" : "false");
    json += "}";
    settingServer.send(200, "application/json; charset=utf-8", json);
}

// OTA页面处理
void webSettingHandleOTA() {
    // 计算总长度
    unsigned int len1 = strlen_P(webComponent);
    unsigned int len2 = strlen_P(ota_html);
    unsigned int totalLen = len1 + len2;

    // 设置 Content-Length 并发送头（空 body）
    settingServer.setContentLength(totalLen);
    settingServer.send(200, "text/html; charset=utf-8", "");

    // 直接发送 PROGMEM 内容块
    settingServer.sendContent_P(webComponent, len1);
    settingServer.sendContent_P(ota_html, len2);
}

// OTA URL处理
void webSettingHandleOTAURL() {
    // 只处理GET请求
    if (settingServer.method() != HTTP_GET) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"请使用 GET 方法上传 URL\"}");
        LOG_WEB_WARN("Received non-GET request for OTA URL");
        return;
    }

    // 如果发送的请求不含URL那么 HTTP400 Bad Request
    if (!settingServer.hasArg("url")) {
        settingServer.send(400, "application/json", "{\"success\":false,\"error\":\"请提供 URL\"}");
        return;
    }
    
    // 如果已有 OTA 在进行那么 HTTP409 Conflict
    if (otaIsInProgress()) {
        settingServer.send(409, "application/json", 
            "{\"success\":false,\"error\":\"当前正在进行 OTA\"}");
        return;
    }
    
    String url = settingServer.arg("url");
    LOG_SYSTEM_INFO("OTA from URL: %s", url.c_str());
    
    // 先响应前端,告诉它 OTA 已开始 (HTTP 202 Accepted)
    settingServer.send(202, "application/json", 
        "{\"success\":true,\"message\":\"OTA started\"}");
    
    // 创建独立任务执行 OTA
    xTaskCreate([](void* param) {
        String* urlPtr = (String*)param;
        bool useHTTPS;
        if(urlPtr->startsWith("https://")){
            useHTTPS = true;
        } else {
            useHTTPS = false;
        }
        OTAResult result = otaUpdateFromURL(*urlPtr, useHTTPS);
        if (result != OTA_SUCCESS) {
            LOG_SYSTEM_ERROR("OTA failed: %s", otaGetErrorString().c_str());
        }
        delete urlPtr;
        vTaskDelete(NULL);
    }, "OTA_Task", 8192, new String(url), 5, NULL);
}

// OTA进度查询
void webSettingHandleOTAProgress() {
    int progress = otaGetProgress();
    OTAStatus status = otaGetStatus();
    String statusStr;
    
    switch(status) {
        case OTA_IDLE:
            statusStr = "\"idle\"";
            break;
        case OTA_RUNNING:
            statusStr = "\"in_progress\"";
            break;
        case OTA_COMPLETED_SUCCESS:
            statusStr = "\"success\"";
            break;
        case OTA_COMPLETED_FAILED:
            statusStr = "\"failed\"";
            break;
        default:
            statusStr = "\"unknown\"";
            break;
    }

    String json = "";
    String errorJson = ",\"error\":\"";

    // 有错误信息时提示客户端
    if(otaGetErrorString() != ""){
        json = "{\"progress\":\"0\",\"status\":\"failed\",\"error\":\"" + otaGetErrorString() + "\"}";
        LOG_SYSTEM_DEBUG("OTA Progress queried with error: " + json);
    }
    
