kuilb/esp32_1602/src/services/web_setting.cpp
    // 无错误信息时正常返回进度和状态
    else{
        json = "{\"progress\":" + String(progress) + ",\"status\":" + statusStr + "}";
        LOG_SYSTEM_DEBUG("OTA Progress queried: " + json);
    }

    settingServer.send(200, "application/json", json);
}

// OTA文件上传处理
void webSettingHandleOTAUpload() {
    if(settingServer.method() != HTTP_POST) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"请使用 POST 方法上传固件\"}");
        LOG_WEB_WARN("Received non-POST request for OTA upload");
        return;
    }

    HTTPUpload& upload = settingServer.upload();

    // 只处理三种合法状态，如果没有文件那么 HTTP400 Bad Request
    if (upload.status != UPLOAD_FILE_START && upload.status != UPLOAD_FILE_WRITE && upload.status != UPLOAD_FILE_END) {
        LOG_WEB_WARN("OTA upload: unexpected upload.status=%d", upload.status);
        settingServer.send(400, "application/json; charset=utf-8", "{\"error\":\"无效的上传状态\"}");
        return;
    }
    
    // 请求上传阶段
    if (upload.status == UPLOAD_FILE_START){
        // 有文件名 => 确认是文件上传
        if (upload.filename && upload.filename.length() > 0) {
            LOG_SYSTEM_INFO("OTA Upload Start: %s", upload.filename.c_str());
            lcdText("Uploading...", 1);
            lcdText(upload.filename, 2);
            updateColor(CRGB::Orange);
            otaExpectedSize = 0;  // 重置预期大小
            
            // http上传无法提前获取文件大小，让update库使用未知大小模式
            if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
                LOG_SYSTEM_ERROR("OTA begin failed");
                lcdText("OTA Begin Fail", 1);
                lcdText("", 2);
                settingServer.send(500, "application/json", 
                    "{\"success\":false,\"error\":\"" + String(Update.errorString()) + "\"}");
                return;
            }
        }
    }

    // 分片上传阶段
    else if (upload.status == UPLOAD_FILE_WRITE) {
        // 如果写入字节不匹配
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
            LOG_SYSTEM_ERROR("OTA write failed");
            Update.abort();  // abort 回滚
            settingServer.send(500, "application/json", 
                "{\"success\":false,\"error\":\"写入失败\"}");
            lcdText("OTA Write Fail", 1);
            lcdText("", 2);
            return;
        }
        
        // 显示已写入的字节数
        static size_t lastReported = 0;
        size_t written = Update.progress();
        // 每100KB显示一次进度
        if (written - lastReported >= 102400 || (written >= 10240 && lastReported == 0)) {
            LOG_SYSTEM_INFO("OTA uploading:%u B (%u KB) written", written, written / 1024);
            lastReported = written;
        }
    }

    // 上传结束阶段
    else if (upload.status == UPLOAD_FILE_END) {
        LOG_SYSTEM_INFO("OTA Upload End: %u bytes (%.2f KB)", upload.totalSize, upload.totalSize / 1024.0);
        otaExpectedSize = upload.totalSize;  // 保存最终大小
        if (Update.end(true)) {
            LOG_SYSTEM_INFO("OTA Success! Firmware size: %u", upload.totalSize);
            lcdText("OTA Success!", 1);
            lcdText("Rebooting...", 2);
            updateColor(CRGB::Green);
            otaUploadSuccess = true;  // 标记上传成功
            
            // 创建后台重启任务，等待结束响应发送完成
            xTaskCreate([](void*){
                delay(2000); 
                ESP.restart();
            }, "Restart_Task", 2048, NULL, 1, NULL);
        } 
        else {  // 如果结束时出错
            LOG_SYSTEM_ERROR("OTA End failed: %s", Update.errorString());
            otaUploadSuccess = false;
            return;
        }
    }
}

// 主页处理函数
void webSettingHandleRoot() {
    // 计算总长度
    unsigned int len1 = strlen_P(webComponent);
    unsigned int len2 = strlen_P(index_html);
    unsigned int totalLen = len1 + len2;

    // 设置 Content-Length 并发送头（空 body）
    settingServer.setContentLength(totalLen);
    settingServer.send(200, "text/html; charset=utf-8", "");

    // 直接发送 PROGMEM 内容块
    settingServer.sendContent_P(webComponent, len1);
    settingServer.sendContent_P(index_html, len2);
}

// 处理上传的 JWT 配置信息 POST + application/json
void webSettingHandleSet() {
    if (settingServer.method() != HTTP_POST) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"不允许的请求方法\"}");
        LOG_WEB_WARN("Received non-POST request for JWT config");
        return;
    }

    if (!settingServer.hasArg("plain")) {
        settingServer.send(400, "application/json; charset=utf-8", "{\"error\":\"请求体为空\"}");
        LOG_WEB_WARN("Received empty request body for JWT config");
        return;
    }

    String body = settingServer.arg("plain");
    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, body);
    if (err) {
        settingServer.send(400, "application/json; charset=utf-8", "{\"error\":\"JSON解析失败\"}");
        LOG_WEB_WARN("Failed to parse JSON for JWT config: %s", err.c_str());
        return;
    }
    if (doc.overflowed()) {
        settingServer.send(413, "application/json; charset=utf-8", "{\"error\":\"JSON大小超过限制\"}");
        LOG_WEB_WARN("JSON size exceeded limit for JWT config");
        return;
    }

    String apiHost = doc["apiHost"] | (doc["host"] | "");
    String kid = doc["kID"] | (doc["kid"] | "");
    String project = doc["projectID"] | (doc["project"] | "");
    String privateKey = doc["privateKey"] | (doc["key"] | "");

    apiHost.trim();
    kid.trim();
    project.trim();
    privateKey.trim();
    
    // Validate base64 PKCS#8 Ed25519 private key using jwt_auth helper
    if (!validate_base64_ed25519_key(privateKey.c_str())) {
        settingServer.send(400, "application/json; charset=utf-8", "{\"error\":\"无效的 privateKey\"}");
        LOG_WEB_WARN("Invalid privateKey base64 PKCS#8");
        return;
    }

    if(!qweatherAuthConfigManager.setAuth(apiHost, kid, project, privateKey)){
        settingServer.send(500, "application/json; charset=utf-8", "{\"error\":\""+ qweatherAuthConfigManager.getLastQWeatherErrorString() +"\"}");
        LOG_WEB_ERROR("Failed to save JWT config");
        return;
    }
    loadJwtConfig();

    // 打印到串口DEBUG等级日志
    LOG_WEATHER_DEBUG("==== Configuration received ====");
    LOG_WEATHER_DEBUG("API Host: " + apiHost);
    LOG_WEATHER_DEBUG("kid: " + kid);
    LOG_WEATHER_DEBUG("projectID: " + project);
    LOG_WEATHER_DEBUG("private key length: " + String(privateKey.length()));

    // 保存成功
    settingServer.send(200, "application/json; charset=utf-8", "{\"ok\":true}");
}

void webSettingHandleGetApiInfo() {
    String json = "{";
    json += "\"apiHost\":\"" + qweatherAuthConfigManager.getApiHost() + "\",";
    json += "\"kID\":\"" + qweatherAuthConfigManager.getKId() + "\",";
    json += "\"projectID\":\"" + qweatherAuthConfigManager.getProjectID() + "\",";
    json += "\"privateKey\":" + String(isKeyDone ? "true" : "false");
    json += "}";
    settingServer.send(200, "application/json; charset=utf-8", json);
}

void webSettingHandleFavicon() {
    LOG_WEB_INFO("Favicon requested, serving /favicon.ico, size=%u", favicon_ico_len);
    // Set cache headers so browsers don't repeatedly request the icon
    settingServer.sendHeader("Cache-Control", "public, max-age=86400");
    settingServer.setContentLength(favicon_ico_len);
    settingServer.send(200, "image/x-icon", "");
    settingServer.sendContent_P(reinterpret_cast<const char*>(favicon_ico), favicon_ico_len);
}

void webSettingHandleCitySearch() {
    // 计算总长度
    unsigned int len1 = strlen_P(webComponent);
    unsigned int len2 = strlen_P(city_search_html);
    unsigned int totalLen = len1 + len2;

    // 设置 Content-Length 并发送头（空 body）
    settingServer.setContentLength(totalLen);
    settingServer.send(200, "text/html; charset=utf-8", "");

    // 直接发送 PROGMEM 内容块
    settingServer.sendContent_P(webComponent, len1);
    settingServer.sendContent_P(city_search_html, len2);
}

String fetchCitySearchResult(String& location) {
    location.trim();

