kuilb/esp32_1602/src/services/web_setting.cpp
    if(!qweatherAuthConfigManager.checkApiConfigValid()){
        LOG_WEATHER_ERROR("API configuration missing for city search");
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"API配置缺失，无法进行城市搜索\"}");
        return " ";
    }

    String varApiHost = qweatherAuthConfigManager.getApiHost();
    String varKid = qweatherAuthConfigManager.getKId();
    String varProjectID = qweatherAuthConfigManager.getProjectID();
    String varBase64Key = qweatherAuthConfigManager.getBase64Key();
    String jwtToken;
    
    // 确保先生成seed32
    generateSeed32();

    // 生成JWT
    jwtToken = generate_jwt(varKid, varProjectID, seed32);
    LOG_WEATHER_DEBUG("City search JWT token generated, length: " + String(jwtToken.length()));
        
    if (varApiHost.length() == 0 || jwtToken.length() == 0) {
        LOG_WEATHER_ERROR("API configuration missing for city search (host or token empty)");
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"API配置缺失，无法进行城市搜索\"}");
        return " ";
    }


    // 请求城市搜索API
    String url = "https://" + varApiHost + "/geo/v2/city/lookup?location=" + location + "&number=10";
    LOG_WEATHER_INFO("City search request URL: " + url);
    
    HTTPClient http;
    http.begin(url);                            // 让HTTPClient自动处理HTTPS和DNS
    http.addHeader("Accept-Encoding", "gzip");
    http.addHeader("Authorization", "Bearer " + jwtToken);
    LOG_WEATHER_DEBUG("City search authorization header set");
    
    int httpCode = http.GET();
    LOG_WEATHER_INFO("City search HTTP response code: " + String(httpCode));
    if (httpCode != 200) {
        http.end();
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"请求失败，HTTP代码：" + String(httpCode) + "\"}");
        return " ";
    }
    int payloadSize = http.getSize();
    
    // 使用RAII内存管理
    MemoryManager::SafeBuffer compressedBuffer(payloadSize + 8, "CitySearch_Response");
    if (!compressedBuffer.isValid()) {
        http.end();
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"内存分配失败\"}");
        return " ";
    }
    
    WiFiClient *stream = http.getStreamPtr();
    long startMillis = millis();
    int iCount = 0;
    while (iCount < payloadSize && (millis() - startMillis) < 4000) {
        if (stream->available()) {
            compressedBuffer.get()[iCount++] = stream->read();
        } else {
            vTaskDelay(5);
        }
    }
    http.end();
    
    String jsonData;
    zlib_turbo zt;
    if (iCount >= 2 && compressedBuffer.get()[0] == 0x1f && compressedBuffer.get()[1] == 0x8b) {
        int uncompSize = zt.gzip_info(compressedBuffer.get(), iCount);
        if (uncompSize <= 0) {
            settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"Gzip解压失败\"}");
            return " ";
        }
        
        MemoryManager::SafeBuffer uncompressedBuffer(uncompSize + 8, "CitySearch_Decompressed");
        if (!uncompressedBuffer.isValid()) {
            settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"内存分配失败\"}");
            return " ";
        }
        
        int rc = zt.gunzip(compressedBuffer.get(), iCount, uncompressedBuffer.get());
        if (rc != ZT_SUCCESS) {
            settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"Gzip解压失败，错误代码：" + String(rc) + "\"}");
            return " ";
        }
        jsonData = String((char *)uncompressedBuffer.get(), uncompSize);
        // uncompressedBuffer 会在作用域结束时自动释放
    } else {
        jsonData = String((char *)compressedBuffer.get(), iCount);
    }
    // compressedBuffer 会在作用域结束时自动释放

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, jsonData);
    if (error) {
        LOG_WEATHER_ERROR("City search JSON parse failed: " + String(error.c_str()));
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"JSON解析失败\"}");
        return " ";
    }
    
    LOG_WEATHER_DEBUG("City search JSON parsed successfully");
    LOG_WEATHER_DEBUG("JSON response: " + jsonData);
    
    // 检查API响应状态
    if (doc["code"].as<String>() != "200") {
        String code = doc["code"].as<String>();
        LOG_WEATHER_WARN("City search API error code: " + code);
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"API错误，错误代码：" + code + "\"}");
        return " ";
    }
    
    // 检查location字段是否存在且为数组
    if (!doc["location"].is<JsonArray>()) {
        LOG_WEATHER_WARN("City search response: location field missing or not array");
        settingServer.send(500, "text/html; charset=utf-8", "{\"error\":\"API响应格式错误，缺少 location 字段\"}");
        return " ";
    }
    JsonArray locArr = doc["location"].as<JsonArray>();
    LOG_WEATHER_INFO("City search found " + String(locArr.size()) + " cities");
    
    if (locArr.size() == 0) {
        settingServer.send(200, "application/json; charset=utf-8", "{\"success\":true,\"results\":[]}");
        return " ";
    }

    for (JsonObject obj : locArr) {
        String name = obj["name"].as<String>();
        String adm1 = obj["adm1"].as<String>();
        String country = obj["country"].as<String>();
        String locid = obj["id"].as<String>();
    }
    // 发送响应JSON
    String json = "{";
    json += "\"success\":true,";
    json += "\"results\":[";

    for (size_t i = 0; i < locArr.size(); ++i) {
        JsonObject obj = locArr[i];
        String name = obj["name"].as<String>();
        String adm1 = obj["adm1"].as<String>();
        String country = obj["country"].as<String>();
        String locid = obj["id"].as<String>();
        String fxlink = obj["fxLink"].as<String>();

        json += "{";
        json += "\"name\":\"" + name + "\",";
        json += "\"adm1\":\"" + adm1 + "\",";
        json += "\"country\":\"" + country + "\",";
        json += "\"locid\":\"" + locid + "\",";
        json += "\"fxlink\":\"" + fxlink + "\"";
        json += "}";

        if (i != locArr.size() - 1) json += ",";
    }

    json += "]";
    json += "}";

