kuilb/esp32_1602/src/services/web_setting.cpp
    LOG_WEATHER_DEBUG("City search result JSON: " + json);
    return json;
}

enum FetchCitySearchState {
    IDLE,
    FETCHING,
    COMPLETED
};
FetchCitySearchState citySearchState = IDLE;
String citySearchResultJson = "";

void webSettingHandleCitySearchResult() {
    if(citySearchState == IDLE){
        if (!settingServer.hasArg("location")) {
            settingServer.send(400, "application/json; charset=utf-8", "{\"error\":\"缺少 location 参数\"}");
            return;
        }
        citySearchState = FETCHING;
        settingServer.send(202, "application/json; charset=utf-8", "{\"status\":\"processing\"}");
        String location = settingServer.arg("location");
        xTaskCreate([](void* param) {
            String loc = *((String*)param);
            LOG_WEATHER_DEBUG("City search task started for location: " + loc);
            citySearchResultJson = fetchCitySearchResult(loc);
            citySearchState = COMPLETED;
            delete (String*)param;
            vTaskDelete(NULL);
        }, "CitySearchTask", 16384, new String(location), 2, NULL);
    } 
    else if(citySearchState == COMPLETED){
        settingServer.send(200, "application/json; charset=utf-8", citySearchResultJson);
        citySearchState = IDLE;
        citySearchResultJson = "";
    }
    else if(citySearchState == FETCHING){
        settingServer.send(202, "application/json; charset=utf-8", "{\"status\":\"processing\"}");
    }
    else {
        settingServer.send(429, "application/json; charset=utf-8", "{\"error\":\"正在处理另一个请求，请稍后再试\"}");
    }

    String location = settingServer.arg("location");
}

void webSettingHandleSetLocation() {
    if (settingServer.method() != HTTP_POST) {
        settingServer.send(405, "application/json; charset=utf-8", "{\"error\":\"请使用 POST 方法\"}");
        return;
    }
    if (!settingServer.hasArg("locid")) {
        settingServer.send(400, "text/html; charset=utf-8", "参数错误");
        return;
    }
    String locid = settingServer.arg("locid");
    locid.trim();

    String cityname = "";
    if (settingServer.hasArg("fxlink")) {
        String fxlink = settingServer.arg("fxlink");
        int start = fxlink.indexOf("/weather/");
        int end = fxlink.lastIndexOf("-");
        if (start != -1 && end != -1 && end > start+9) {
            cityname = fxlink.substring(start+9, end);
        }
    }
    else{
        LOG_WEATHER_INFO("No fxlink provided, using locid as city name");
        cityname = locid;
    }
    
    // 保存到配置文件（追加或覆盖）
    qweatherAuthConfigManager.setLocation(locid, cityname);
    
    locid = qweatherAuthConfigManager.getLocation().c_str();
    cityname = qweatherAuthConfigManager.getCityName().c_str();

    loadJwtConfig();

    weatherSynced = false;
    isReadyToDisplay = false;

    LOG_WEATHER_INFO("Location set to ID: %s, Name: %s", locid.c_str(), cityname.c_str());
    settingServer.send(200, "application/json; charset=utf-8", "{\"ok\":true,\"locid\":\"" + locid + "\"}");
}

void webSettingSetupWebServer() {
    if(wifiConnectionState != WIFI_CONNECTED) {
        LOG_SYSTEM_WARN("Web setting server setup called but WiFi not connected");
        lcdText("WiFi Not Conn", 1);
        lcdText(" ", 2);
        delay(1000);
        return;
    }

    if (!s_otaModuleInitialized) {
        otaInit();
        s_otaModuleInitialized = true;
    }

    isConfigDone=false;

    settingServer.onNotFound([](){ settingServer.send(404, "text/plain", "404 Not Found"); });

    // 主页相关路由w
    settingServer.on("/", webSettingHandleRoot);                        // 主页
    settingServer.on("/favicon.ico", webSettingHandleFavicon);          // 网站图标
    settingServer.on("/get_api_info", webSettingHandleGetApiInfo);      // 获取当前API信息
    settingServer.on("/set", HTTP_POST, webSettingHandleSet);           // 接收POST JSON格式的API配置信息
    settingServer.on("/exit", [](){                                     // 退出设置页面
        isConfigDone = true;
        settingServer.send(200, "text/plain", "Exiting configuration...");
    });

    // OTA相关路由
    settingServer.on("/ota", webSettingHandleOTA);                         // OTA页面
    settingServer.on("/ota/url", webSettingHandleOTAURL);                  // OTA URL处理
    settingServer.on("/ota/progress", webSettingHandleOTAProgress);        // OTA进度查询
    settingServer.on("/ota/upload", HTTP_POST, 
        []() { 
            // 处理完成后的回调
            if (otaUploadSuccess) {
                settingServer.send(200, "application/json", "{\"success\":true}");
            } else {
                String errorMsg = Update.hasError() ? String(Update.errorString()) : "上传失败";
                settingServer.send(500, "application/json", 
                    "{\"success\":false,\"error\":\"" + errorMsg + "\"}");
            }
            otaUploadSuccess = false;  // 重置标志
        },
        webSettingHandleOTAUpload  // 上传处理函数
    );

    // 城市搜索相关路由
    settingServer.on("/citysearch", webSettingHandleCitySearch);    // 城市搜索界面
    settingServer.on("/citysearch_result", webSettingHandleCitySearchResult);
    settingServer.on("/set_location", webSettingHandleSetLocation);
    settingServer.on("/settings/city_search_ready", webSettingHandleCitySearchReady);

    // 设置菜单相关路由
    settingServer.on("/settings/status", webSettingHandleDeviceStatus);
    settingServer.on("/settings/basic_info", webSettingHandleDeviceBasicInfo);
    settingServer.on("/settings/als", webSettingHandleAlsRealtimeInfo);
    settingServer.on("/settings/fuel", webSettingHandleFuelGaugeRealtimeInfo);
    settingServer.on("/settings/wifi", webSettingHandleWifiInfo);
    settingServer.on("/settings/brightness", HTTP_POST, webSettingHandleSetBrightness);
    settingServer.on("/settings/auto_brightness/toggle", HTTP_POST, webSettingHandleToggleAutoBrightness);
    settingServer.on("/settings/sound_effects/toggle", HTTP_POST, webSettingHandleToggleSoundEffects);
    
    settingServer.begin();
    LOG_WEATHER_INFO("Web configuration server started, access via IP address");
    
    // 获取当前IP地址并显示
    String ipAddress = WiFi.localIP().toString();
    lcdText("Config Mode", 1);
    lcdText(ipAddress.c_str(), 2);
    while(isConfigDone == false){
        settingServer.handleClient();
        delay(1);
    }

    lcdText("Config Done", 1);
    lcdText("Exiting...", 2);
    delay(500);
}